/*
 Navicat Premium Data Transfer

 Source Server         : chl
 Source Server Type    : MySQL
 Source Server Version : 80200 (8.2.0)
 Source Host           : localhost:3306
 Source Schema         : mydb1

 Target Server Type    : MySQL
 Target Server Version : 80200 (8.2.0)
 File Encoding         : 65001

 Date: 25/05/2024 17:16:09
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for news
-- ----------------------------
DROP TABLE IF EXISTS `news`;
CREATE TABLE `news`  (
  `news_id` int NOT NULL,
  `news_title` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `news_content` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `news_author` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `news_date` datetime NULL DEFAULT NULL,
  `news_link` varchar(100) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `news_read_count` int NULL DEFAULT NULL,
  `news_image_url` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL,
  `label_id` int NULL DEFAULT NULL,
  PRIMARY KEY (`news_id`) USING BTREE
) ENGINE = InnoDB CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of news
-- ----------------------------
INSERT INTO `news` VALUES (1, '专家访谈：打造人工智能创新生态圈  积蓄高质量发展新动能', 'QMG青岛广电4月15日讯  凭借强大的对话能力和以假乱真的视觉表现，人工智能成为当今科技领域最受瞩目的一颗明珠。人工智能的迭代日新月异，会给生活带来哪些改变？面对时代的机遇和挑战，青岛的人工智能产业该从哪些方面发力？本台记者专访了中国石油大学计算机科学与技术学院副教授曹绍华。\r\n\r\n中国石油大学计算机科学与技术学院副教授 曹绍华：人工智能能够使计算机或机器以类似于人类的方式理解、学习、判断和解决问题，它延伸和扩展了人类智能，是引领未来的战略性技术，也是新质生产力的典型代表。\r\n\r\n我在2001年开始接触人工智能，在中国石油大学工作之后，主要从事边缘智能以及通过人工智能在石油相关领域预测与解释等方面的研究，比如在研的课题有一项是通过深度学习模型对钻井过程中地层孔隙压力进行预测，该项技术成熟应用后，可以有效减少钻井事故的发生。\r\n\r\n人工智能会给我们的生活带来什么变化？\r\n\r\n人工智能是全球新一轮科技革命和产业变革的核心驱动力，出现了像ChatGPT、Sora等大批生成式AI的新技术和新业态。眼下，人工智能正在逐步改变我们的生活方式，比如在医疗领域，帮助医生进行疾病诊断，提高治疗的精准性；在交通领域，自动驾驶和智能交通将减少交通拥堵和事故；在教育领域，可以为学生提供个性化学习计划……总之，AI将使我们的生活更加便捷、高效和安全。\r\n\r\n青岛发展人工智能有哪些优势？\r\n\r\n青岛是中国的重要工业基地之一，尤其在高端制造业、海洋科技、生物技术等领域有着坚实的基础，并且拥有多所知名高校和研究机构，在人工智能及相关领域具有较强的研发能力和人才培养优势。青岛市高度重视人工智能产业发展，出台了系列扶持政策，并将人工智能列为24条重点发展的产业链之一。2019年，青岛获批全国第二个人工智能创新应用先导区，同时借助“打造工业互联网之都”“工赋青岛 智造强市”等一系列活动，已在多个维度上取得突破性发展。\r\n\r\n青岛发展人工智能应该从哪些方面发力？\r\n\r\n目前青岛拥有青岛海洋国家超算中心，中国移动智算中心（青岛）等大量的算力资源，可以进一步统筹整合，同时加强人工智能产业园区建设，加强人才培养与国际交流，建立产学研用紧密结合的合作机制，形成人工智能创新生态圈。特别是要运用人工智能技术，推动制造业、港口物流、海洋科技等传统优势行业的转型升级，提高交通、教育、医疗、城市管理等公共服务领域的服务质效，从而进一步巩固和扩大青岛在人工智能领域的领先地位，推动发展新质生产力，促进整个城市经济社会的高质量发展。', '蓝睛', '2024-04-15 20:05:00', 'https://lanjingshare.qtvnews.com/share-html/lanjing/share/newsDetailsLj.html?id=16189031', 29348, '/media/news/1.png', 1);
INSERT INTO `news` VALUES (2, '学院举办新进教师发展座谈会', '为加强学院教师队伍建设，促进青年教师成长发展，加强对新进教师教学和科研能力的指导，4月9日上午学院举办新进教师发展座谈会。会议由建设办公室主任兼副院长刘培勇主持，学院领导班子成员、指导教师、2020-2023年新进青年教师参加会议。\r\n\r\n\r\n\r\n新进教师逐一汇报了来院后在教学科研、学科和专业建设、服务学院发展等方面开展的工作，谈到了在课堂教学、科研方向探索、研究生培养等方面遇到的问题和困惑，以及下一步的工作计划。陈程立诏分享了他在主讲《机器学习》课程中的心得体会，并将深入挖掘专业课程中所蕴含的思想政治教育资源，做好育人工作；感谢学院提供良好的工作环境，提升了青年教师的幸福感和荣誉感。\r\n\r\n\r\n\r\n与会院领导和指导教师逐项回应了发言教师提出的问题，结合自身成长经历给出了建设性意见。副院长宋弢提到，青年教师在关注所在岗位的职责和聘期任务的同时，也要注重全面发展，在人才培养、科学研究、社会服务过程中实现职业生涯的长远发展。李克文教授讲述了自己进校初期的教学科研经历，鼓励青年教师积极参与学院工作，将自身发展与学院发展紧密相连，充分利用学院提供的优质平台和资源，和学院一起成长、和学院一起发展。\r\n\r\n\r\n\r\n院长庞善臣在座谈会上首先感谢新进教师对学院的热爱和所做的贡献，承诺学院将尽全力支持和保障青年教师的发展与进步，并对青年教师提出了期许。一是既要“走出去”，也要“请进来”，主动加强学术交流，扩展研究视野和方法，找准自身的科研定位；二是作为课堂的第一责任人，青年教师要以高度责任感和使命感投身课堂教学工作，营造良好的教学氛围，做好教学研究，提升教育教学能力；三是要把握新时代大学生成长发展规律，注重育人实效，激发学生学习的内生动力，共同促进学院学风建设；四是青年教师要做到“人岗适配”，深入了解学校学院政策以及发展规划，为自己做好长远的职业规划。\r\n\r\n\r\n\r\n刘培勇在总结中指出，本次座谈会搭建了学院与青年教师双向沟通的交流平台，今后将定期举行，持续为青年教师提供相互切磋、相互学习、共同发展的大平台，实现青年教师综合能力的大发展；青年教师是学院发展的主力军和生力军，是学院发展的可见未来，希望青年教师把自身发展融入学院发展大局，在全面推进软件学院的内涵建设中贡献智慧与力量。', '杨素琴', '2024-04-10 11:30:00', 'https://computer.upc.edu.cn/2024/0410/c6277a427996/page.htm', 150, '/media/news/2.jpg', 2);
INSERT INTO `news` VALUES (3, '青岛软件园来校对接争创“中国软件名园”工作', '4月3日，青岛市市南区工业和信息化局党组成员、区化工专项行动办专职副主任陆晗，青岛海诺投资发展有限公司（青岛软件园）副总经理贺长泽一行来校对接争创“中国软件名园”工作。青岛软件学院、计算机科学与技术学院副院长宋弢，青岛软件学院建设办公室副主任王林富，产学研合作办公室主任刘培刚，学院办公室主任张玮参会。\r\n\r\n\r\n\r\n双方主要围绕建设“中国软件名园”重点指标中的开源能力指标，针对目前开源项目孵化少、人才和技术缺乏的现状，就组织专题研讨会、开展开源战略与创新管理培训、设立开源人才培训班等活动的必要性和可行性进行深入讨论，表达了进一步推动市南区政府、青岛软件园、青岛软件学院与开源基金会开展实质性合作的强烈意愿。下一步，双方将共同探索与开源基金会的合作机制，汇聚“政产学研”各界力量，全力营造区域性的良性开源生态。\r\n\r\n此外，双方还围绕组织学生入园实习实训，助力就业创业和人才留青、组织举办第三届“东方杯”大赛等内容进行交流，持续深化校企合作和院园合作，携手为青岛市软件和信息服务产业高质量发展做出更大贡献。', '张爱艳', '2024-04-03 00:00:00', 'https://computer.upc.edu.cn/2024/0403/c6277a427526/page.htm', 340, '/media/news/3.jpg', 3);

SET FOREIGN_KEY_CHECKS = 1;
